app/views/yearly_infos/_form.html.erb

SELECT "profiles".* FROM "profiles" WHERE "profiles"."user_id" = ? ORDER BY "profiles"."id" ASC LIMIT 1  [["user_id", 1]]
SELECT "users".* FROM "users"
---
    <%= f.label "User:" %><br>
    <%= f.select :user_id, options_for_select(Profile.all.map{|profile| [profile.firstName + " " + profile.lastName, profile.user_id]}, @yearly_info.user_id), {}, {:class => 'form-control'} %>