app/views/yearly_infos/index.html.erb

      <tr>
        <% name = yearly_info.user.profile.firstName + " " + yearly_info.user.profile.lastName %>
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."user_id" = ? ORDER BY "profiles"."id" ASC LIMIT 1  [["user_id", 2]]
SELECT "users".* FROM "users" WHERE "users"."id" = 1 ORDER BY "users"."id" ASC LIMIT 1