app/controllers/essays_controller.rb

SELECT "essays".* FROM "essays" WHERE "essays"."year" = 1914
SELECT "essays".* FROM "essays"
---
  def index
    if params[:year]
      @essays = Essay.where(year: params[:year])
    else
      @essays = Essay.all

SELECT "essays".* FROM "essays" WHERE "essays"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @essay = Essay.find(params[:id])

INSERT INTO "essays" ("created_at", "essay", "updated_at", "user_id", "year") VALUES (?, ?, ?, ?, ?)  [["created_at", Tue, 06 May 2014 02:13:44 UTC +00:00], ["essay", "asd"], ["updated_at", Tue, 06 May 2014 02:13:44 UTC +00:00], ["user_id", 2], ["year", 2014]]
---
  def create
    @essay = current_user.essay.build(essay_params)
    @essay.year = (Time.zone.now.year)

    respond_to do |format|
      if @essay.save

UPDATE "essays" SET "year" = ?, "updated_at" = ? WHERE "essays"."id" = 10  [["year", 2013], ["updated_at", Tue, 06 May 2014 18:45:03 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @essay.update(essay_params)

DELETE FROM "essays" WHERE "essays"."id" = ?  [["id", 1]]
---
  def destroy
    @essay.destroy

SELECT "essays".* FROM "essays" WHERE "essays"."user_id" = 4
---
  def view_all_owned
    @essays = Essay.where(user_id: params[:user_id])

SELECT "essays".* FROM "essays" WHERE "essays"."year" IS NULL
---
  def view_by_year
    @essays = Essay.where(year: params[:year])

SELECT "essays".* FROM "essays" WHERE "essays"."id" = ? LIMIT 1  [["id", "9"]]
---
    def set_essay
      @essay = Essay.find(params[:id])