app/controllers/profiles_controller.rb

  def index
    @profiles = Profile.order(:lastName)
---
SELECT "profiles".* FROM "profiles" ORDER BY "profiles"."lastName" ASC

  def show
    @profile = Profile.find(params[:id])
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @profile = current_user.build_profile(profile_params)
    respond_to do |format|
      if @profile.save
---
INSERT INTO "profiles" ("cellPhone", "cityAddr", "created_at", "dateOfBirth", "email", "enrollNum", "firstName", "gender", "guard1Name", "guard2Name", "guardEmail", "homePhone", "lastName", "midInitial", "stateAddr", "streetAddr", "updated_at", "user_id", "zipAddr") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "profiles" SET "user_id" = ?, "updated_at" = ? WHERE "profiles"."id" = 1  [["user_id", nil], ["updated_at", Wed, 23 Apr 2014 02:10:05 UTC +00:00]]

  def update
    respond_to do |format|
      if @profile.update(profile_params)
---
UPDATE "profiles" SET "firstName" = ?, "midInitial" = ?, "lastName" = ?, "userType" = ?, "updated_at" = ? WHERE "profiles"."id" = 8  [["firstName", "John"], ["midInitial", ""], ["lastName", "Smith"], ["userType", "User"], ["updated_at", Tue, 06 May 2014 06:04:18 UTC +00:00]]

  def destroy
    @profile.destroy
---
DELETE FROM "profiles" WHERE "profiles"."id" = ?  [["id", 1]]