app/controllers/yearly_infos_controller.rb

SELECT "yearly_infos".* FROM "yearly_infos" WHERE "yearly_infos"."year" = 'year' LIMIT 1
SELECT "yearly_infos".* FROM "yearly_infos"
---
  def index
    if params[:year]
      @yearly_infos = YearlyInfo.where(year: params[:year])
    else
      @yearly_infos = YearlyInfo.all

SELECT "yearly_infos".* FROM "yearly_infos" WHERE "yearly_infos"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @yearly_info = YearlyInfo.find(params[:id])

SELECT "yearly_infos".* FROM "yearly_infos" WHERE "yearly_infos"."id" = ? LIMIT 1  [["id", "9"]]
---
  def edit
    @yearly_info = YearlyInfo.find(params[:id])

INSERT INTO "yearly_infos" ("comments", "created_at", "role", "updated_at", "user_id", "year") VALUES (?, ?, ?, ?, ?, ?)  [["comments", ""], ["created_at", Tue, 06 May 2014 20:15:52 UTC +00:00], ["role", "Staff"], ["updated_at", Tue, 06 May 2014 20:15:52 UTC +00:00], ["user_id", 1], ["year", 1914]]
---
  def create
    @yearly_info = current_user.yearly_info.build(yearly_info_params)

    respond_to do |format|
      if @yearly_info.save

UPDATE "yearly_infos" SET "role" = ?, "updated_at" = ? WHERE "yearly_infos"."id" = 6  [["role", "Staff"], ["updated_at", Tue, 06 May 2014 20:00:29 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @yearly_info.update(yearly_info_params)

DELETE FROM "yearly_infos" WHERE "yearly_infos"."id" = ?  [["id", 1]]
---
  def destroy
    @yearly_info.destroy

SELECT "yearly_infos".* FROM "yearly_infos" WHERE "yearly_infos"."user_id" = 1 ORDER BY "yearly_infos"."year" ASC
---
  def view_all_owned
    @yearly_infos = YearlyInfo.where(user_id: params[:user_id]).order(:year)

SELECT "yearly_infos".* FROM "yearly_infos" WHERE "yearly_infos"."year" = 'year' LIMIT 1
---
  def view_by_year
    @yearly_infos = YearlyInfo.where(year: params[:year])

SELECT "yearly_infos".* FROM "yearly_infos" WHERE "yearly_infos"."role" = 'Volunteer' ORDER BY "yearly_infos"."year" ASC
---
  def view_by_role
    @yearly_infos = YearlyInfo.where(role: params[:role]).order(:year)

SELECT "yearly_infos".* FROM "yearly_infos" WHERE "yearly_infos"."id" = ? LIMIT 1  [["id", "7"]]
---
    def set_yearly_info
      @yearly_info = YearlyInfo.find(params[:id])