app/views/essays/index.html.erb

      <tr>
        <% name = essay.user.profile.firstName + " " + essay.user.profile.lastName %>
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."user_id" = ? ORDER BY "profiles"."id" ASC LIMIT 1  [["user_id", 2]]
SELECT "users".* FROM "users" WHERE "users"."id" = 2 ORDER BY "users"."id" ASC LIMIT 1