app/views/essays/view_all_owned.html.erb

      <tr>
        <% name = essay.user.profile.firstName + essay.user.profile.lastName %>
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."user_id" = ? ORDER BY "profiles"."id" ASC LIMIT 1  [["user_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = 1 ORDER BY "users"."id" ASC LIMIT 1